app/views/espy_records/index.html.erb

SELECT "espy_records".* FROM "espy_records"
---
    <% if params.has_key?(:state) && params[:state] != "*" %>
      <%= collection_select(:state, :state_abbreviation, EspyRecord.all.uniq{|x| x.state_abbreviation} , :state_abbreviation, :state_abbreviation, {:prompt => true, :selected => params[:state]}, class: 'form-control', :onchange => "location.href = 'espy_records?state=' + this.value") %>