app/views/espy_records/make.html.erb

SELECT "index_cards".* FROM "index_cards"
---
    <% if params.has_key?(:state) %>
    	<%= collection_select(:state, :state_abbreviation, IndexCard.all.uniq{|x| x.state_abbreviation} , :state_abbreviation, :state_abbreviation, {:prompt => true, :selected => params[:state]}, class: 'form-control', :onchange => "location.href = 'make?state=' + this.value") %>