app/views/references/link.html.erb

  <% @used = Reference.where(used_check: true).count %>
  <% @total = Reference.count %>
---
SELECT "references".* FROM "references"