app/controllers/espy_records_controller.rb

SELECT "espy_records".* FROM "espy_records"
---
  def index
    if params[:state]
      if params[:state] == "*"
        @espy_records = EspyRecord.all

SELECT "index_cards".* FROM "index_cards"
---
  def make
    @index_card = IndexCard.all