app/controllers/icpsr_records_controller.rb

  def index
    if params[:state]
      if params[:state] == "*"
        @icpsr_records = IcpsrRecord.all
---
SELECT "icpsr_records".* FROM "icpsr_records"