app/controllers/index_cards_controller.rb

SELECT "index_cards".* FROM "index_cards"
---
  def index
    if params[:state]
      if params[:state] == "*"
        @index_cards = IndexCard.all