app/controllers/references_controller.rb

  def link
    if params[:folder]
      @references = Reference.all.where(folder_name: params[:folder])
    else
      @references = Reference.all
---
SELECT "references".* FROM "references"