app/views/icpsr_records/index.html.erb

    <% if params.has_key?(:state) && params[:state] != "*" %>
      <%= collection_select(:state, :state_abbreviation, IcpsrRecord.all.uniq{|x| x.state_abbreviation} , :state_abbreviation, :state_abbreviation, {:prompt => true, :selected => params[:state]}, class: 'form-control', :onchange => "location.href = 'icpsr_records?state=' + this.value") %>
---
SELECT "icpsr_records".* FROM "icpsr_records"