app/views/index_cards/index.html.erb

  <% @used = IndexCard.where(used_check: true).count %>
  <% @total = IndexCard.count %>
---
SELECT "index_cards".* FROM "index_cards"